import 'song_item.dart';

class SongItemManager {
  List<SongItem> song = [
    SongItem(
        lyrics: """1. അടവിതരുക്കളിന്നിടയില്‍ 
  ഒരുനാരകം എന്നവണ്ണം (2)
  വിശുദ്ധരിന്‍ നടുവില്‍കാണുന്നേ 
  അതിശ്രേഷ്‌ഠനാം യേശുവിനെ (2)

    വാഴ്‌ത്തുമേ എന്‍റെ പ്രിയനെ 
    ജീവകാലമെല്ലാം 
    ഈമരുയാത്രയില്‍ 
    നന്ദിയോടെഞാന്‍ പാടിടുമേ (2)

2. പനിനീര്‍പുഷ്പം ശാരോനിലവന്‍ 
  താമരയുമേ താഴ്‌വരയില്‍ 
  വിശുദ്ധരില്‍ അതിവിശുദ്ധനവന്‍ 
  മാ സൗന്ദര്യ സമ്പൂര്‍ണ്ണനേ (വാഴ്‌ത്തുമേ..)

3. പകര്‍ന്ന തൈലം പോല്‍നിന്‍നാമം
  പാരില്‍ സൗരഭ്യം വീശുന്നതാല്‍ 
  പഴി, ദുഷി, നിന്ദ, ഞെരുക്കങ്ങളില്‍ 
  എന്നെ സുഗന്ധമായ് മാറ്റിടണേ (വാഴ്‌ത്തുമേ..)

4. മനഃക്ലേശതരം‍ഗങ്ങളാല്‍, ദുഃഖ
  സാഗരത്തില്‍ മുങ്ങുമ്പോള്‍ 
  തിരുക്കരം നീട്ടിയെടുത്തണച്ചു
  ഭയപ്പെടേണ്ടായെന്നുരച്ചവനേ (വാഴ്‌ത്തുമേ..)

5. തിരുഹിതമിഹെ തികച്ചിടുവാന്‍ 
  ഇതാ ഞാനിപ്പോള്‍ വന്നിടുന്നേ  
  എന്‍റെ വേലയെ തികച്ചുകൊണ്ട് 
  തിരുമുമ്പില്‍ ഞാന്‍ നിന്നിടുമേ (വാഴ്‌ത്തുമേ..)""",
        title: 'അടവിതരുക്കളിന്നിടയില് ഒരുനാരകം എന്നവണ്ണം',
        titleEng: 'adavitharukalinidayil oru naarakam',
        num: 501),
    SongItem(
      lyrics: """   പരിശുദ്ധാത്മാവേ ശക്തി പകര്‍ന്നിടണേ 
   അവിടുത്തെ ബലം ഞങ്ങള്‍ക്കാവശ്യമെന്ന് 
   കര്‍ത്താവേ നീ അറിയുന്നു 

1. ആദ്യനൂറ്റാണ്ടിലെ അനുഭവം പോല്‍ 
  അതിശയം ലോകത്തില്‍ നടന്നിടുവാന്‍ 
  ആദിയിലെന്നപോലാത്മാവേ 
  അമിതബലംതരണേ (പരിശുദ്ധാത്മാവേ..)

2. ലോകത്തിന്‍ മോഹം വിട്ടോടുവാന്‍ 
  സാത്താന്യശക്തിയെ ജയിച്ചിടുവാന്‍ 
  ധീരതയോടു നിന്‍ വേല ചെയ്‌വാന്‍ 
  അഭിഷേകം ചെയ്‌തിടണേ (പരിശുദ്ധാത്മാവേ..)

3. കൃപകളും വരങ്ങളും ജ്വലിച്ചീടുവാന്‍ 
  ഞങ്ങള്‍ വചനത്തില്‍ വേരൂന്നി വളര്‍ന്നിടുവാന്‍ 
  പിന്മഴയെ വീണ്ടും അയയ്‌ക്കേണമേ 
  നിന്‍ജനം ഉണര്‍ന്നീടുവാന്‍ (പരിശുദ്ധാത്മാവേ..)""",
      title:
          'പരിശുദ്ധാത്മാവേ ശക്തി പകര്‍ന്നിടണേ അവിടുത്തെ ബലം ഞങ്ങള്‍ക്കാവശ്യമെന്ന്',
      titleEng: 'parishudhanmaave shakthi pakarnidane',
      num: 502,
    ),
    SongItem(
      lyrics: """ഉണര്‍വ്വിന്‍ വരം ലഭിപ്പാന്‍ 
  ഞങ്ങള്‍ വരുന്നൂ തിരുസവിധേ 
  നാഥാ - നിന്‍റെ വന്‍ കൃപകള്‍ 
  ഞങ്ങള്‍ക്കരുളൂ അനുഗ്രഹിക്കൂ

  1. ദേശമെല്ലാം ഉണര്‍ന്നീടുവാന്‍ 
  യേശുവിനെ ഉയര്‍ത്തീടുവാന്‍
  ആശിഷമാരി അയയ്‌ക്കേണമേ 
  ഈ ശിഷ്യരാം നിന്‍ ദാസരിന്മേല്‍ (ഉണര്‍വ്വിന്‍..‍) 

  2. തിരുവചനം ഘോഷിക്കുവാന്‍ 
  തിരുനന്മകള്‍ സാക്ഷിക്കുവാന്‍ 
  ഉണര്‍വ്വിന്‍ ശക്തി അയയ്‌ക്കേണമേ 
  ഈ ശിഷ്യരാം നിന്‍ ദാസരിന്മേല്‍ (ഉണര്‍വ്വിന്‍..‍) 

  3. തിരുനാമം പാടിടുവാന്‍ 
  തിരുവചനം ധ്യാനിക്കുവാന്‍
  ശാശ്വത ശാന്തി അയയ്‌ക്കേണമേ 
  ഈ ശിഷ്യരാം നിന്‍ ദാസരിന്മേല്‍ (ഉണര്‍വ്വിന്‍..‍) """,
      titleEng: 'unarvin varam labhikaan',
      title: 'ഉണര്‍വ്വിന്‍ വരം ലഭിപ്പാന്‍ ഞങ്ങള്‍ വരുന്നൂ തിരുസവിധേ‍',
      num: 503,
    ),
  ];

  SongItem getSong(int num) {
    return song[num - 1];
  }
}
